nthuepl/CodeGenerator/python/sdcc/cc2541relay.h
#define MAP_ATT_BuildErrorRsp                              0xcd0
#define MAP_ATT_BuildExchangeMTURsp                        0xcdc
#define MAP_ATT_BuildFindByTypeValueRsp                    0xcf4
#define MAP_ATT_BuildFindInfoRsp                           0xce8
#define MAP_ATT_BuildHandleValueInd                        0xd48
#define MAP_ATT_BuildPrepareWriteRsp                       0xd3c
#define MAP_ATT_BuildReadBlobRsp                           0xd1e
#define MAP_ATT_BuildReadByGrpTypeRsp                      0xd30
#define MAP_ATT_BuildReadByTypeRsp                         0xd00
#define MAP_ATT_BuildReadMultiRsp                          0xd2a
#define MAP_ATT_BuildReadRsp                               0xd0c
#define MAP_ATT_CompareUUID                                0xd54
#define MAP_ATT_ConvertUUIDto128                           0xd5a
#define MAP_ATT_ErrorRsp                                   0xc76
#define MAP_ATT_ExchangeMTURsp                             0xc7c
#define MAP_ATT_ExecuteWriteRsp                            0xcb8
#define MAP_ATT_FindByTypeValueRsp                         0xc88
#define MAP_ATT_FindInfoRsp                                0xc82
#define MAP_ATT_HandleValueInd                             0xcc4
#define MAP_ATT_HandleValueNoti                            0xcbe
#define MAP_ATT_ParseExchangeMTUReq                        0xcd6
#define MAP_ATT_ParseExecuteWriteReq                       0xd42
#define MAP_ATT_ParseFindByTypeValueReq                    0xcee
#define MAP_ATT_ParseFindInfoReq                           0xce2
#define MAP_ATT_ParsePacket                                0xcca
#define MAP_ATT_ParsePrepareWriteReq                       0xd36
#define MAP_ATT_ParseReadBlobReq                           0xd18
#define MAP_ATT_ParseReadByTypeReq                         0xcfa
#define MAP_ATT_ParseReadMultiReq                          0xd24
#define MAP_ATT_ParseReadReq                               0xd06
#define MAP_ATT_ParseWriteReq                              0xd12
#define MAP_ATT_PrepareWriteRsp                            0xcb2
#define MAP_ATT_ReadBlobRsp                                0xc9a
#define MAP_ATT_ReadByGrpTypeRsp                           0xca6
#define MAP_ATT_ReadByTypeRsp                              0xc8e
#define MAP_ATT_ReadMultiRsp                               0xca0
#define MAP_ATT_ReadRsp                                    0xc94
#define MAP_ATT_WriteRsp                                   0xcac
#define MAP_Accel_AddService                               0x90a
#define MAP_Accel_GetParameter                             0x91c
#define MAP_Accel_RegisterAppCBs                           0x910
#define MAP_Accel_SetParameter                             0x916
#define MAP_Batt_AddService                                0x934
#define MAP_Batt_Register                                  0x93a
#define MAP_CodeGeneratorStartPoint                        0xc1c
#define MAP_CodeGenerator_EVT_1_CB                         0xbfe
#define MAP_CodeGenerator_EVT_2_CB                         0xc04
#define MAP_CodeGenerator_EVT_3_CB                         0xc0a
#define MAP_CodeGenerator_EVT_4_CB                         0xc10
#define MAP_DevInfo_AddService                             0x952
#define MAP_DevInfo_SetParameter                           0x958
#define MAP_EcoExecProfileChangeCB                         0xbda
#define MAP_EcoExecProfile_AddService                      0x7de
#define MAP_EcoExecProfile_GetParameter                    0x7ea
#define MAP_EcoExecProfile_HandleConnStatusCB              0x7fc
#define MAP_EcoExecProfile_ReadAttrCB                      0x7f0
#define MAP_EcoExecProfile_RegisterAppCBs                  0x7e4
#define MAP_EcoExecProfile_WriteAttrCB                     0x7f6
#define MAP_GAPBondMgr_Init                                0xa48
#define MAP_GAPBondMgr_LinkEst                             0x9dc
#define MAP_GAPBondMgr_ProcessEvent                        0xa4e
#define MAP_GAPBondMgr_ProcessGAPMsg                       0x9fa
#define MAP_GAPBondMgr_Register                            0x9f4
#define MAP_GAPBondMgr_ResolveAddr                         0x9e2
#define MAP_GAPBondMgr_ServiceChangeInd                    0x9e8
#define MAP_GAPBondMgr_SetParameter                        0x9d6
#define MAP_GAPBondMgr_UpdateCharCfg                       0x9ee
#define MAP_GAPRole_GetParameter                           0xb9e
#define MAP_GAPRole_Init                                   0xbb0
#define MAP_GAPRole_ProcessEvent                           0xbb6
#define MAP_GAPRole_SendUpdateParam                        0xbc2
#define MAP_GAPRole_SetParameter                           0xb98
#define MAP_GAPRole_StartDevice                            0xba4
#define MAP_GAPRole_TerminateConnection                    0xbaa
#define MAP_GAP_Authenticate                               0xdf0
#define MAP_GAP_Bond                                       0xe02
#define MAP_GAP_DeviceInit                                 0x9d0
#define MAP_GAP_EndDiscoverable                            0xe68
#define MAP_GAP_GetParamValue                              0xd66
#define MAP_GAP_Init                                       0xeb6
#define MAP_GAP_MakeDiscoverable                           0xe5c
#define MAP_GAP_NumActiveConnections                       0xec2
#define MAP_GAP_ParamsInit                                 0xd6c
#define MAP_GAP_PasscodeUpdate                             0xdfc
#define MAP_GAP_PeriDevMgrInit                             0xe6e
#define MAP_GAP_ProcessEvent                               0xebc
#define MAP_GAP_RegisterForHCIMsgs                         0xeb0
#define MAP_GAP_ResolvePrivateAddr                         0xdcc
#define MAP_GAP_SecParamsInit                              0xd72
#define MAP_GAP_SendSlaveSecurityRequest                   0xeaa
#define MAP_GAP_SetParamValue                              0xd60
#define MAP_GAP_Signable                                   0xdea
#define MAP_GAP_TerminateAuth                              0xdf6
#define MAP_GAP_TerminateLinkReq                           0xde4
#define MAP_GAP_UpdateAdvertisingData                      0xe62
#define MAP_GATTServApp_AddService                         0xfe8
#define MAP_GATTServApp_FindAttr                           0xfe2
#define MAP_GATTServApp_Init                               0xfca
#define MAP_GATTServApp_InitCharCfg                        0x1054
#define MAP_GATTServApp_ProcessCCCWriteReq                 0x1066
#define MAP_GATTServApp_ProcessCharCfg                     0x106c
#define MAP_GATTServApp_ProcessEvent                       0xfd0
#define MAP_GATTServApp_ReadAttr                           0x103c
#define MAP_GATTServApp_ReadCharCfg                        0x105a
#define MAP_GATTServApp_RegisterForMsg                     0xfc4
#define MAP_GATTServApp_RegisterService                    0xfd6
#define MAP_GATTServApp_SendCCCUpdatedEvent                0x1078
#define MAP_GATTServApp_SendServiceChangedInd              0x104e
#define MAP_GATTServApp_UpdateCharCfg                      0x1048
#define MAP_GATTServApp_WriteAttr                          0x1042
#define MAP_GATTServApp_WriteCharCfg                       0x1060
#define MAP_GATT_FindHandle                                0xf22
#define MAP_GATT_FindHandleUUID                            0xf1c
#define MAP_GATT_FindNextAttr                              0xf28
#define MAP_GATT_Indication                                0xf34
#define MAP_GATT_Init                                      0xfa0
#define MAP_GATT_InitServer                                0xef8
#define MAP_GATT_Notification                              0xf3a
#define MAP_GATT_ProcessEvent                              0xfa6
#define MAP_GATT_RegisterForReq                            0xf04
#define MAP_GATT_RegisterService                           0xefe
#define MAP_GATT_ServiceChangedInd                         0xf16
#define MAP_GATT_ServiceNumAttrs                           0xf2e
#define MAP_GATT_VerifyReadPermissions                     0xf0a
#define MAP_GATT_VerifyWritePermissions                    0xf10
#define MAP_GGS_AddService                                 0xee0
#define MAP_GGS_SetParameter                               0xeda
#define MAP_HCI_CommandCompleteEvent                       0x1138
#define MAP_HCI_CommandStatusEvent                         0x1144
#define MAP_HCI_DataBufferOverflowEvent                    0x112c
#define MAP_HCI_DisconnectCmd                              0x108a
#define MAP_HCI_EXT_ClkDivOnHaltCmd                        0x10de
#define MAP_HCI_EXT_DeclareNvUsageCmd                      0x10e4
#define MAP_HCI_GAPTaskRegister                            0x1798
#define MAP_HCI_Init                                       0x178c
#define MAP_HCI_L2CAPTaskRegister                          0x179e
#define MAP_HCI_LE_AddWhiteListCmd                         0x10c6
#define MAP_HCI_LE_ClearWhiteListCmd                       0x10c0
#define MAP_HCI_LE_LtkReqNegReplyCmd                       0x10d8
#define MAP_HCI_LE_LtkReqReplyCmd                          0x10d2
#define MAP_HCI_LE_RandCmd                                 0x10cc
#define MAP_HCI_LE_ReadBufSizeCmd                          0x109c
#define MAP_HCI_LE_SetAdvDataCmd                           0x10ae
#define MAP_HCI_LE_SetAdvEnableCmd                         0x10ba
#define MAP_HCI_LE_SetAdvParamCmd                          0x10a8
#define MAP_HCI_LE_SetRandomAddressCmd                     0x10a2
#define MAP_HCI_LE_SetScanRspDataCmd                       0x10b4
#define MAP_HCI_NumOfCompletedPacketsEvent                 0x1132
#define MAP_HCI_ProcessEvent                               0x1792
#define MAP_HCI_ReadBDADDRCmd                              0x1090
#define MAP_HCI_ReadRssiCmd                                0x1096
#define MAP_HCI_SMPTaskRegister                            0x17a4
#define MAP_HCI_SendCommandCompleteEvent                   0x1150
#define MAP_HCI_SendCommandStatusEvent                     0x114a
#define MAP_HCI_SendControllerToHostEvent                  0x1156
#define MAP_HCI_SendDataPkt                                0x1084
#define MAP_HCI_TxDataBufferInsert                         0x1102
#define MAP_HCI_TxDataSend                                 0x1108
#define MAP_HCI_VendorSpecifcCommandCompleteEvent          0x113e
#define MAP_HCI_bm_alloc                                   0x107e
#define MAP_HalAdcInit                                     0xa78
#define MAP_HalAdcRead                                     0xa7e
#define MAP_HalAdcSetReference                             0xa84
#define MAP_HalAesInit                                     0xa90
#define MAP_HalDmaInit                                     0xa96
#define MAP_HalDriverInit                                  0xaa2
#define MAP_HalFlashErase                                  0xac0
#define MAP_HalFlashRead                                   0xab4
#define MAP_HalFlashWrite                                  0xaba
#define MAP_HalI2CInit                                     0xacc
#define MAP_HalI2CRead                                     0xad2
#define MAP_HalI2CWrite                                    0xad8
#define MAP_HalKeyConfig                                   0xae4
#define MAP_HalKeyInit                                     0xade
#define MAP_HalKeyPoll                                     0xaea
#define MAP_HalLedBlink                                    0xb08
#define MAP_HalLedInit                                     0xafc
#define MAP_HalLedOnOff                                    0xb14
#define MAP_HalLedSet                                      0xb02
#define MAP_HalLedUpdate                                   0xb0e
#define MAP_Hal_Init                                       0xa9c
#define MAP_Hal_ProcessEvent                               0xaa8
#define MAP_Hal_ProcessPoll                                0xaae
#define MAP_InitBoard                                      0x8f2
#define MAP_L2CAP_BuildCmdReject                           0x11e0
#define MAP_L2CAP_CmdReject                                0x1192
#define MAP_L2CAP_ConnParamUpdateReq                       0x1198
#define MAP_L2CAP_Init                                     0x119e
#define MAP_L2CAP_ParseParamUpdateReq                      0x11f2
#define MAP_L2CAP_ProcessEvent                             0x11a4
#define MAP_L2CAP_RegisterApp                              0x1186
#define MAP_L2CAP_SendData                                 0x118c
#define MAP_L2CAP_bm_alloc                                 0x122e
#define MAP_LL_AddWhiteListDevice                          0x129a
#define MAP_LL_ClearWhiteList                              0x1294
#define MAP_LL_ConnActive                                  0x12ee
#define MAP_LL_ConnParamUpdateCback                        0x1168
#define MAP_LL_ConnectionCompleteCback                     0x115c
#define MAP_LL_CtrlToHostFlowControl                       0x12b2
#define MAP_LL_Disconnect                                  0x12be
#define MAP_LL_DisconnectCback                             0x1162
#define MAP_LL_ENC_AES128_Encrypt                          0x1420
#define MAP_LL_ENC_Decrypt                                 0x1450
#define MAP_LL_ENC_DecryptMsg                              0x143e
#define MAP_LL_ENC_Encrypt                                 0x144a
#define MAP_LL_ENC_EncryptMsg                              0x1438
#define MAP_LL_ENC_GenDeviceIV                             0x141a
#define MAP_LL_ENC_GenDeviceSKD                            0x1414
#define MAP_LL_ENC_GenerateMIC                             0x1444
#define MAP_LL_ENC_GeneratePseudoRandNum                   0x1408
#define MAP_LL_ENC_GenerateTrueRandNum                     0x140e
#define MAP_LL_ENC_InitAesDMA                              0x1426
#define MAP_LL_ENC_LoadEmptyIV                             0x1432
#define MAP_LL_ENC_MoveData                                0x142c
#define MAP_LL_ENC_ReverseBytes                            0x1402
#define MAP_LL_EXT_ClkDivOnHalt                            0x12f4
#define MAP_LL_EXT_DeclareNvUsage                          0x12fa
#define MAP_LL_EXT_ExtendRfRangeCback                      0x10fc
#define MAP_LL_EXT_SetRxGainCback                          0x10f0
#define MAP_LL_EXT_SetTxPowerCback                         0x10f6
#define MAP_LL_EncChangeCback                              0x117a
#define MAP_LL_EncKeyRefreshCback                          0x1180
#define MAP_LL_EncLtkNegReply                              0x12e8
#define MAP_LL_EncLtkReply                                 0x12e2
#define MAP_LL_EncLtkReqCback                              0x1174
#define MAP_LL_Encrypt                                     0x12a0
#define MAP_LL_Init                                        0x1276
#define MAP_LL_ProcessEvent                                0x127c
#define MAP_LL_PseudoRand                                  0x12ac
#define MAP_LL_Rand                                        0x12a6
#define MAP_LL_RandCback                                   0x10ea
#define MAP_LL_ReadBDADDR                                  0x1288
#define MAP_LL_ReadRemoteVersionInfoCback                  0x116e
#define MAP_LL_ReadRssi                                    0x12b8
#define MAP_LL_Reset                                       0x1282
#define MAP_LL_RxDataCompleteCback                         0x111a
#define MAP_LL_RxReqDataBufCback                           0x1114
#define MAP_LL_SetAdvControl                               0x12d6
#define MAP_LL_SetAdvData                                  0x12d0
#define MAP_LL_SetAdvParam                                 0x12ca
#define MAP_LL_SetRandomAddress                            0x128e
#define MAP_LL_SetScanRspData                              0x12dc
#define MAP_LL_TxData                                      0x12c4
#define MAP_LL_TxDataCompleteCback                         0x1120
#define MAP_OnBoard_KeyCallback                            0x904
#define MAP_OnBoard_SendKeys                               0x8fe
#define MAP_Onboard_rand                                   0x8f8
#define MAP_PHY_AddWlEntry                                 0x155e
#define MAP_PHY_ClearAllRegsAndFifos                       0x1510
#define MAP_PHY_ClearBlacklist                             0x1576
#define MAP_PHY_ClearBlacklistIndex                        0x1570
#define MAP_PHY_ClearSavedWhiteList                        0x157c
#define MAP_PHY_ClearWhitelist                             0x1558
#define MAP_PHY_CommitRxFifo                               0x15a6
#define MAP_PHY_ConfigWhitener                             0x1594
#define MAP_PHY_ConfigureAppendRfStatus                    0x1588
#define MAP_PHY_ConfigureFifoDataProcessing                0x1582
#define MAP_PHY_ConfigureMD                                0x153a
#define MAP_PHY_DeallocateRxFifo                           0x15ac
#define MAP_PHY_GetAdvChans                                0x1528
#define MAP_PHY_GetEndCause                                0x1540
#define MAP_PHY_Init                                       0x1504
#define MAP_PHY_InitSeqStat                                0x1546
#define MAP_PHY_Reset                                      0x150a
#define MAP_PHY_RetryRxFifo                                0x15a0
#define MAP_PHY_RetryTxFifo                                0x159a
#define MAP_PHY_SetAdvChans                                0x152e
#define MAP_PHY_SetAdvWlPolicy                             0x1564
#define MAP_PHY_SetBlacklistIndex                          0x156a
#define MAP_PHY_SetCRCInit                                 0x1522
#define MAP_PHY_SetEndConnection                           0x1534
#define MAP_PHY_SetFifoConfig                              0x158e
#define MAP_PHY_SetMaxNack                                 0x1552
#define MAP_PHY_SetOwnAddr                                 0x1516
#define MAP_PHY_SetPeerAddr                                0x151c
#define MAP_PHY_SetRfFreq                                  0x15b2
#define MAP_PHY_SetSyncWord                                0x154c
#define MAP_SM_CalcRandomAddr                              0x15be
#define MAP_SM_GenerateAuthenSig                           0x15ca
#define MAP_SM_Init                                        0x16f0
#define MAP_SM_PasskeyUpdate                               0x1636
#define MAP_SM_ProcessEvent                                0x16f6
#define MAP_SM_ResolveRandomAddrs                          0x15c4
#define MAP_SM_ResponderInit                               0x16c6
#define MAP_SM_StartPairing                                0x1630
#define MAP_SM_VerifyAuthenSig                             0x15d0
#define MAP_SimpleBLEPeripheral_Init                       0xbc8
#define MAP_SimpleBLEPeripheral_ProcessEvent               0xbce
#define MAP_SimpleProfile_AddService                       0xc22
#define MAP_SimpleProfile_GetParameter                     0xc34
#define MAP_SimpleProfile_RegisterAppCBs                   0xc28
#define MAP_SimpleProfile_SetParameter                     0xc2e
#define MAP_accInit                                        0x964
#define MAP_accReadAcc                                     0x976
#define MAP_accReadReg                                     0x970
#define MAP_accSetFreeFallEvent                            0x97c
#define MAP_accWriteReg                                    0x96a
#define MAP_accelEnablerChangeCB                           0xbf2
#define MAP_accelRead                                      0xbe0
#define MAP_accel_HandleConnStatusCB                       0x92e
#define MAP_accel_ReadAttrCB                               0x922
#define MAP_accel_WriteAttrCB                              0x928
#define MAP_aesDmaInit                                     0xa8a
#define MAP_attSendMsg                                     0xd4e
#define MAP_battMeasure                                    0x94c
#define MAP_battProfileChangeCB                            0xbf8
#define MAP_battReadAttrCB                                 0x940
#define MAP_battWriteAttrCB                                0x946
#define MAP_bm_desc_from_payload                           0xb2c
#define MAP_cleanErasedPage                                0xb5c
#define MAP_compactPage                                    0xb74
#define MAP_devInfo_ReadAttrCB                             0x95e
#define MAP_disconnectNext                                 0xe2c
#define MAP_erasePage                                      0xb56
#define MAP_findItem                                       0xb68
#define MAP_findOffset                                     0xb62
#define MAP_gapAddAddrAdj                                  0xd8a
#define MAP_gapBondMgrAddBond                              0xa18
#define MAP_gapBondMgrAuthenticate                         0xa60
#define MAP_gapBondMgrBondReq                              0xa66
#define MAP_gapBondMgrBondTotal                            0xa36
#define MAP_gapBondMgrChangeState                          0xa00
#define MAP_gapBondMgrEraseAllBondings                     0xa3c
#define MAP_gapBondMgrEraseBonding                         0xa42
#define MAP_gapBondMgrFindAddr                             0xa24
#define MAP_gapBondMgrFindCharCfgItem                      0xa0c
#define MAP_gapBondMgrGetPublicAddr                        0xa1e
#define MAP_gapBondMgrInvertCharCfgItem                    0xa12
#define MAP_gapBondMgrReadBonds                            0xa30
#define MAP_gapBondMgrResolvePrivateAddr                   0xa2a
#define MAP_gapBondMgrSendServiceChange                    0xa54
#define MAP_gapBondMgrUpdateCharCfg                        0xa06
#define MAP_gapBondMgr_SyncCharCfg                         0xa72
#define MAP_gapBondMgr_SyncWhiteList                       0xa6c
#define MAP_gapBondSetupPrivFlag                           0xa5a
#define MAP_gapDetermineAddrType                           0xd90
#define MAP_gapFindADType                                  0xdde
#define MAP_gapFreeAdvertState                             0xe9e
#define MAP_gapFreeAuthLink                                0xe38
#define MAP_gapFreeEstLink                                 0xe3e
#define MAP_gapGetDevAddress                               0xdba
#define MAP_gapGetDevAddressMode                           0xdb4
#define MAP_gapGetIRK                                      0xdc0
#define MAP_gapGetSRK                                      0xd9c
#define MAP_gapGetSignCounter                              0xda2
#define MAP_gapIncSignCounter                              0xda8
#define MAP_gapIsAdvertising                               0xdd2
#define MAP_gapPairingCompleteCB                           0xe56
#define MAP_gapPasskeyNeededCB                             0xe50
#define MAP_gapPeriProcessHCICmdCompleteEvt                0xe74
#define MAP_gapProcessAdvertisingEvt                       0xe92
#define MAP_gapProcessConnUpdateCompleteEvt                0xe0e
#define MAP_gapProcessConnectionCompleteEvt                0xe08
#define MAP_gapProcessDisconnectCompleteEvt                0xe14
#define MAP_gapProcessHCICmdCompleteEvt                    0xece
#define MAP_gapProcessNewAddr                              0xd84
#define MAP_gapProcessOSALMsg                              0xec8
#define MAP_gapProcessRandomAddrComplete                   0xd96
#define MAP_gapReadBD_ADDRStatus                           0xd78
#define MAP_gapReadBufSizeCmdStatus                        0xd7e
#define MAP_gapRegisterPeripheral                          0xed4
#define MAP_gapRole_ProcessGAPMsg                          0xbbc
#define MAP_gapSendBondCompleteEvent                       0xe44
#define MAP_gapSendDeviceInitDoneEvent                     0xdc6
#define MAP_gapSendLinkUpdateEvent                         0xe26
#define MAP_gapSendMakeDiscEvent                           0xe98
#define MAP_gapSendPairingReqEvent                         0xe4a
