nthuepl/CodeGenerator/python/sdcc/cc2541relay.h
#define MAP_gapSetAdvParams                                0xe7a
#define MAP_gapSetAdvParamsStatus                          0xe80
#define MAP_gapUpdateConnSignCounter                       0xdae
#define MAP_gapValidADType                                 0xdd8
#define MAP_gapWriteAdvDataStatus                          0xe8c
#define MAP_gapWriteAdvEnableStatus                        0xe86
#define MAP_gattFindServerInfo                             0xf88
#define MAP_gattGetServerStatus                            0xf82
#define MAP_gattNotifyEvent                                0xfb2
#define MAP_gattProcessExchangeMTUReq                      0xf4c
#define MAP_gattProcessExecuteWriteReq                     0xf7c
#define MAP_gattProcessFindByTypeValueReq                  0xf58
#define MAP_gattProcessFindInfoReq                         0xf52
#define MAP_gattProcessReadByGrpTypeReq                    0xf70
#define MAP_gattProcessReadByTypeReq                       0xf5e
#define MAP_gattProcessReadMultiReq                        0xf6a
#define MAP_gattProcessReadReq                             0xf64
#define MAP_gattProcessRxData                              0xfac
#define MAP_gattProcessWriteReq                            0xf76
#define MAP_gattRegisterServer                             0xf9a
#define MAP_gattServApp_FindAuthorizeAttrCB                0x1030
#define MAP_gattServApp_FindCharCfgItem                    0x102a
#define MAP_gattServApp_FindPrepareWriteQ                  0x1024
#define MAP_gattServApp_FindServiceCBs                     0xfee
#define MAP_gattServApp_HandleConnStatusCB                 0x1072
#define MAP_gattServApp_ProcessExecuteWriteReq             0x101e
#define MAP_gattServApp_ProcessFindByTypeValueReq          0xffa
#define MAP_gattServApp_ProcessMsg                         0xff4
#define MAP_gattServApp_ProcessPrepareWriteReq             0x1018
#define MAP_gattServApp_ProcessReadByGrpTypeReq            0x100c
#define MAP_gattServApp_ProcessReadByTypeReq               0x1000
#define MAP_gattServApp_ProcessReadMultiReq                0x1006
#define MAP_gattServApp_ProcessWriteReq                    0x1012
#define MAP_gattServApp_SetNumPrepareWrites                0xfdc
#define MAP_gattServApp_WriteAttrCB                        0x1036
#define MAP_gattServerHandleConnStatusCB                   0xf94
#define MAP_gattServerHandleTimerCB                        0xf8e
#define MAP_gattServerProcessMsgCB                         0xf46
#define MAP_gattServiceLastHandle                          0xf40
#define MAP_gattStartTimer                                 0xfb8
#define MAP_gattStopTimer                                  0xfbe
#define MAP_generate_subkey                                0x161e
#define MAP_ggs_ReadAttrCB                                 0xeec
#define MAP_ggs_SetAttrWPermit                             0xee6
#define MAP_ggs_WriteAttrCB                                0xef2
#define MAP_halGetJoyKeyInput                              0xaf0
#define MAP_halProcessAlarmInterrupt                       0x7d2
#define MAP_halProcessFreeFallInterrupt                    0x7d8
#define MAP_halProcessKeyInterrupt                         0xaf6
#define MAP_hciInitEventMasks                              0x1126
#define MAP_hciTxDataBufferReset                           0x110e
#define MAP_i2cMstStrt                                     0xac6
#define MAP_initNV                                         0xb4a
#define MAP_isLimitedDiscoverableMode                      0xea4
#define MAP_l2capAllocChannel                              0x120a
#define MAP_l2capBuildParamUpdateReq                       0x11ec
#define MAP_l2capEncapSendData                             0x11d4
#define MAP_l2capFindLocalId                               0x1216
#define MAP_l2capFreeChannel                               0x1210
#define MAP_l2capHandleRxError                             0x1228
#define MAP_l2capHandleTimerCB                             0x1222
#define MAP_l2capNotifyData                                0x11fe
#define MAP_l2capNotifySignal                              0x1204
#define MAP_l2capParseCmdReject                            0x11e6
#define MAP_l2capParsePacket                               0x11da
#define MAP_l2capParseParamUpdateRsp                       0x11f8
#define MAP_l2capParseSignalHdr                            0x11c2
#define MAP_l2capProcessReq                                0x11bc
#define MAP_l2capProcessRsp                                0x11b6
#define MAP_l2capProcessRxData                             0x11aa
#define MAP_l2capProcessSignal                             0x11b0
#define MAP_l2capSendCmd                                   0x11ce
#define MAP_l2capSendReq                                   0x11c8
#define MAP_l2capStopTimer                                 0x121c
#define MAP_leftshift_onebit                               0x162a
#define MAP_linkDB_Add                                     0x1240
#define MAP_linkDB_Authen                                  0x1264
#define MAP_linkDB_Find                                    0x124c
#define MAP_linkDB_FindFirst                               0x1252
#define MAP_linkDB_Init                                    0x1234
#define MAP_linkDB_NumActive                               0x125e
#define MAP_linkDB_PerformFunc                             0x126a
#define MAP_linkDB_Register                                0x123a
#define MAP_linkDB_Remove                                  0x1246
#define MAP_linkDB_State                                   0x1258
#define MAP_llAdjustForMissedEvent                         0x13ea
#define MAP_llAdvEvt_TaskAbort                             0x131e
#define MAP_llAdvEvt_TaskConnect                           0x1306
#define MAP_llAllocConnId                                  0x13ba
#define MAP_llAllocTask                                    0x1474
#define MAP_llClearSetInts                                 0x132a
#define MAP_llConnCleanup                                  0x13cc
#define MAP_llConnTerminate                                0x13d2
#define MAP_llConvertCtrlProcTimeoutToEvent                0x13e4
#define MAP_llConvertLstoToEvent                           0x13de
#define MAP_llDequeueCtrlPkt                               0x13a8
#define MAP_llDirectedAdvEvt_TaskEndOk                     0x1300
#define MAP_llDisableT2E1                                  0x14ec
#define MAP_llDisableT2Ints                                0x14e0
#define MAP_llDisableT2IntsEvts                            0x14e6
#define MAP_llDiscoverableAdvEvt_TaskEndOk                 0x1312
#define MAP_llEnqueueCtrlPkt                               0x13a2
#define MAP_llExtendRfRange                                0x133c
#define MAP_llFindNextSecTask                              0x146e
#define MAP_llFindTxPowerSettings                          0x1336
#define MAP_llFreeTask                                     0x147a
#define MAP_llGetActiveTasks                               0x148c
#define MAP_llGetCurrentTask                               0x1480
#define MAP_llGetCurrentTime                               0x14f8
#define MAP_llGetNextConn                                  0x13c6
#define MAP_llGetNumTasks                                  0x1492
#define MAP_llGetTaskState                                 0x1486
#define MAP_llGetTimer2Capture                             0x14f2
#define MAP_llInitFeatureSet                               0x13d8
#define MAP_llInitTimer2                                   0x14c2
#define MAP_llMemCopySrc                                   0x13fc
#define MAP_llNonConnAdvEvt_TaskEndOk                      0x1318
#define MAP_llProcessChanMap                               0x13b4
#define MAP_llProcessPendingTxData                         0x13f0
#define MAP_llProcessPostRfOps                             0x1330
#define MAP_llProcessSlaveControlProcedures                0x14bc
#define MAP_llReleaseAllConnId                             0x13c0
#define MAP_llReplaceCtrlPkt                               0x13ae
#define MAP_llRestoreConnState                             0x14a4
#define MAP_llRfInit                                       0x1324
#define MAP_llSave_rxFIFO                                  0x149e
#define MAP_llSave_txFIFO                                  0x1498
#define MAP_llScheduleTask                                 0x1468
#define MAP_llScheduler                                    0x1462
#define MAP_llSchedulerInit                                0x145c
#define MAP_llSetT2C1Event1                                0x14ce
#define MAP_llSetT2LongC1Event1                            0x14d4
#define MAP_llSetT2LongC1Timeout                           0x14c8
#define MAP_llSetT2OVFC2Event2                             0x14da
#define MAP_llSetupAdv                                     0x1342
#define MAP_llSetupDirectedAdvEvt                          0x1348
#define MAP_llSetupEncRsp                                  0x136c
#define MAP_llSetupFeatureSetRsp                           0x138a
#define MAP_llSetupNextSlaveEvent                          0x14b6
#define MAP_llSetupNonConnectableAdvEvt                    0x1354
#define MAP_llSetupPauseEncRsp                             0x137e
#define MAP_llSetupRejectInd                               0x1384
#define MAP_llSetupScannableAdvEvt                         0x135a
#define MAP_llSetupStartEncReq                             0x1372
#define MAP_llSetupStartEncRsp                             0x1378
#define MAP_llSetupTermInd                                 0x1396
#define MAP_llSetupUndirectedAdvEvt                        0x134e
#define MAP_llSetupUnknownRsp                              0x139c
#define MAP_llSetupVersionIndReq                           0x1390
#define MAP_llSlaveEvt_TaskAbort                           0x14b0
#define MAP_llSlaveEvt_TaskEndOk                           0x14aa
#define MAP_llStartAdvSetup                                0x1360
#define MAP_llStartSlaveSetup                              0x1366
#define MAP_llUndirectedAdvEvt_TaskEndOk                   0x130c
#define MAP_llUnexpectedEndCauseHandler                    0x1456
#define MAP_llWriteTxData                                  0x13f6
#define MAP_ll_McuPrecisionCount                           0x14fe
#define MAP_memset                                         0x820
#define MAP_osalAddTimer                                   0x8bc
#define MAP_osalDeleteTimer                                0x8c8
#define MAP_osalFindTimer                                  0x8c2
#define MAP_osalInitTasks                                  0x8b0
#define MAP_osalTimeUpdate                                 0x886
#define MAP_osalTimerInit                                  0x8b6
#define MAP_osalTimerUpdate                                0x8e6
#define MAP_osal_CbTimerInit                               0xb32
#define MAP_osal_CbTimerProcessEvent                       0xb38
#define MAP_osal_CbTimerStart                              0xb3e
#define MAP_osal_CbTimerStop                               0xb44
#define MAP_osal_GetSystemClock                            0x8ec
#define MAP_osal_bm_adjust_header                          0xb26
#define MAP_osal_bm_alloc                                  0xb1a
#define MAP_osal_bm_free                                   0xb20
#define MAP_osal_clear_event                               0x862
#define MAP_osal_get_timeoutEx                             0x8e0
#define MAP_osal_init_system                               0x86e
#define MAP_osal_int_disable                               0x868
#define MAP_osal_isbufset                                  0x880
#define MAP_osal_mem_alloc                                 0x898
#define MAP_osal_mem_free                                  0x89e
#define MAP_osal_mem_init                                  0x88c
#define MAP_osal_mem_kick                                  0x892
#define MAP_osal_memcmp                                    0x81a
#define MAP_osal_memcpy                                    0x808
#define MAP_osal_memdup                                    0x814
#define MAP_osal_memset                                    0x820
#define MAP_osal_msg_allocate                              0x82c
#define MAP_osal_msg_deallocate                            0x832
#define MAP_osal_msg_enqueue                               0x84a
#define MAP_osal_msg_enqueue_push                          0x83e
#define MAP_osal_msg_extract                               0x856
#define MAP_osal_msg_push                                  0x850
#define MAP_osal_msg_receive                               0x844
#define MAP_osal_msg_send                                  0x838
#define MAP_osal_pwrmgr_init                               0x8a4
#define MAP_osal_pwrmgr_task_state                         0x8aa
#define MAP_osal_rand                                      0x826
#define MAP_osal_revmemcpy                                 0x80e
#define MAP_osal_run_system                                0x87a
#define MAP_osal_set_event                                 0x85c
#define MAP_osal_snv_init                                  0xb86
#define MAP_osal_snv_read                                  0xb92
#define MAP_osal_snv_write                                 0xb8c
#define MAP_osal_start_reload_timer                        0x8d4
#define MAP_osal_start_system                              0x874
#define MAP_osal_start_timerEx                             0x8ce
#define MAP_osal_stop_timerEx                              0x8da
#define MAP_osal_strlen                                    0x802
#define MAP_peripheralStateNotificationCB                  0xbd4
#define MAP_phyFindWlEntry                                 0x15b8
#define MAP_reportStatusChange                             0x1270
#define MAP_rtcGetAlarm                                    0x9ca
#define MAP_rtcGetDate                                     0x9be
#define MAP_rtcGetTime                                     0x9b2
#define MAP_rtcInit                                        0x9a6
#define MAP_rtcSetAlarm                                    0x9c4
#define MAP_rtcSetDate                                     0x9b8
#define MAP_rtcSetTime                                     0x9ac
#define MAP_sendAuthEvent                                  0xe32
#define MAP_sendEstLinkEvent                               0xe1a
#define MAP_sendTerminateEvent                             0xe20
#define MAP_setActivePage                                  0xb50
#define MAP_simpleProfileChangeCB                          0xbec
#define MAP_simpleProfile_HandleConnStatusCB               0xc46
#define MAP_simpleProfile_ReadAttrCB                       0xc3a
#define MAP_simpleProfile_WriteAttrCB                      0xc40
#define MAP_smAuthReqToUint8                               0x1606
#define MAP_smDetermineKeySize                             0x16ba
#define MAP_smEncrypt                                      0x1612
#define MAP_smEndPairing                                   0x16b4
#define MAP_smFreePairingParams                            0x16ae
#define MAP_smGenerateConfirm                              0x167e
#define MAP_smGeneratePairingReqRsp                        0x1678
#define MAP_smGenerateRandBuf                              0x1600
#define MAP_smGenerateRandMsg                              0x1684
#define MAP_smLinkCheck                                    0x1642
#define MAP_smNextPairingState                             0x1660
#define MAP_smPairingSendEncInfo                           0x1690
#define MAP_smPairingSendIdentityAddrInfo                  0x16a2
#define MAP_smPairingSendIdentityInfo                      0x169c
#define MAP_smPairingSendMasterID                          0x1696
#define MAP_smPairingSendSingingInfo                       0x16a8
#define MAP_smProcessDataMsg                               0x164e
#define MAP_smProcessEncryptChange                         0x165a
#define MAP_smProcessOSALMsg                               0x16fc
#define MAP_smProcessPairingReq                            0x166c
#define MAP_smProcessRandComplete                          0x15d6
#define MAP_smRegisterResponder                            0x163c
#define MAP_smResponderProcessLTKReq                       0x16cc
#define MAP_smResponderSendNextKeyInfo                     0x16ea
#define MAP_smSavePairInfo                                 0x168a
#define MAP_smSendFailAndEnd                               0x1654
#define MAP_smSendSMMsg                                    0x1786
#define MAP_smSetPairingReqRsp                             0x16c0
#define MAP_smStartEncryption                              0x1672
#define MAP_smStartRspTimer                                0x15dc
#define MAP_smStopRspTimer                                 0x15e2
#define MAP_smTimedOut                                     0x1648
#define MAP_smUint8ToAuthReq                               0x160c
#define MAP_sm_CMAC                                        0x1618
#define MAP_sm_ah                                          0x15e8
#define MAP_sm_c1                                          0x1666
#define MAP_sm_c1new                                       0x15ee
#define MAP_sm_s1                                          0x15fa
#define MAP_sm_xor                                         0x15f4
#define MAP_smpBuildEncInfo                                0x173e
#define MAP_smpBuildIdentityAddrInfo                       0x175c
#define MAP_smpBuildIdentityInfo                           0x1756
#define MAP_smpBuildMasterID                               0x174a
#define MAP_smpBuildPairingConfirm                         0x171a
#define MAP_smpBuildPairingFailed                          0x1732
#define MAP_smpBuildPairingRandom                          0x1726
#define MAP_smpBuildPairingReq                             0x1702
#define MAP_smpBuildPairingReqRsp                          0x170e
#define MAP_smpBuildPairingRsp                             0x1708
#define MAP_smpBuildSecurityReq                            0x177a
#define MAP_smpBuildSigningInfo                            0x176e
#define MAP_smpParseEncInfo                                0x1744
#define MAP_smpParseIdentityAddrInfo                       0x1768
#define MAP_smpParseIdentityInfo                           0x1762
#define MAP_smpParseMasterID                               0x1750
#define MAP_smpParsePairingConfirm                         0x1720
#define MAP_smpParsePairingFailed                          0x1738
#define MAP_smpParsePairingRandom                          0x172c
#define MAP_smpParsePairingReq                             0x1714
#define MAP_smpParseSecurityReq                            0x1780
#define MAP_smpParseSigningInfo                            0x1774
#define MAP_smpResponderProcessIncoming                    0x16d2
#define MAP_smpResponderProcessMasterID                    0x16e4
#define MAP_smpResponderProcessPairingRandom               0x16de
#define MAP_smpResponderProcessPairingReq                  0x16d8
#define MAP_spiInit                                        0x98e
#define MAP_spiReadByte                                    0x988
#define MAP_spiWriteByte                                   0x982
#define MAP_strlen                                         0x802
#define MAP_timeRead                                       0xbe6
#define MAP_timeserviceChangeCB                            0xc16
#define MAP_timeservice_AddService                         0xc4c
#define MAP_timeservice_GetParameter                       0xc5e
#define MAP_timeservice_HandleConnStatusCB                 0xc70
#define MAP_timeservice_ReadAttrCB                         0xc64
#define MAP_timeservice_RegisterAppCBs                     0xc52
#define MAP_timeservice_SetParameter                       0xc58
#define MAP_timeservice_WriteAttrCB                        0xc6a
#define MAP_uartInit                                       0x994
#define MAP_uartWriteByte                                  0x99a
#define MAP_uartWriteString                                0x9a0
#define MAP_verInfo                                        0xf88
#define MAP_verifyWordM                                    0xb7a
#define MAP_writeItem                                      0xb6e
#define MAP_writeWord                                      0xb80
#define MAP_xor_128                                        0x1624
#define MAP_notify                                         0xea6
#define MAP_simpleBLEPeripheral_TaskID                     0xfbd
#define MAP_accelEnabler                                   0xc95
#define MAP_attDeviceName                                  0x17dd
#define MAP_timeEnabler                                    0xc96
